ERP DEV.WMS/src/Catalogs/вмс_ПравилаЗаполненияЗадачиКладовщику/вмс_ПравилаЗаполненияЗадачиКладовщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_ПравилаЗаполненияЗадачиКладовщику</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоНастройкаПолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДанныеСКД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеКладовщикуРаспоряжение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьПлан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтправитель</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаПолучатель</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗонуОтбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОСГНаОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контейнеры_ПеремещатьЦелыми</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контейнеры_РазбиратьКонтейнеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контейнеры_СобиратьКонтейнеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НестрогоеПланированиеЯчейкиОтбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияВозврат</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияНазначение</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтбиратьПоПомещениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгружатьКонтейнерыБезПересчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗонуОтправитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгружатьСоСлужебнойЗоныОтправителя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКонтейнеров_СначалаКонтейнеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКонтейнеров_СначалаМонотоварныеКонтейнеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКонтейнеров_СначалаЦелые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодбиратьЯчейкиОтправители</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодбиратьЯчейкиПолучатели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодбиратьЯчейкиПоСкладам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпитка_ИспользоватьОСГНаОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпитка_ОбъединятьВОдноЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпитка_ПодбиратьЯчейкиПоПомещениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпитка_ПодбиратьЯчейкиПоСкладам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждатьЗонуПолучатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьДополнительныеЯчейкиПриемки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриниматьНаСлужебнуюЗонуПолучатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмещатьКонтейнерыБезПересчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспоряжениеКонфигуратор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныйРежимРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимФормированияЗаданий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнойВводЗоныПолучателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СледующееПравило</name>
    <type>
      <types>CatalogRef.вмс_ПравилаЗаполненияЗадачиКладовщику</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрогоеПланированиеЯчейки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТестирование</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗоныОтправителя</name>
    <type>
      <types>EnumRef.вмс_ТипыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗоныПолучателя</name>
    <type>
      <types>EnumRef.вмс_ТипыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Товары_ЗаполнятьПоОтобранным</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Товары_ЗаполнятьПоПринятым</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Товары_Переопределяемые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка_ВводПоПлану</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьЯчейкуОтправитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьЯчейкуПолучатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДДокументы</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДОснований</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДТовары</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДШапкиДокумента</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеТестирование</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСоответствиеРеквизитов</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеДанныеСКД</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Шапка_Переопределяемая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтбиратьПросроченныеТовары</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараллельноеФормированиеЗаданийСледующегоЭтапа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контейнеры_ПеремещатьЦелыми_НестрогоеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контейнеры_РазбиратьКонтейнеры_НестрогоеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контейнеры_СобиратьКонтейнеры_НестрогоеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьПолныйКодМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДШапкиДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСоответствиеРеквизитов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДТовары</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДОснований</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДДокументы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредыдущиеОперации</name>
    <attributes>
      <name>ПредыдущаяОперация</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыЯчеекОтправителей</name>
    <attributes>
      <name>ТипЯчейки</name>
      <type>
        <types>EnumRef.вмс_ТипыЯчеек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыЯчеекПолучателей</name>
    <attributes>
      <name>ТипЯчейки</name>
      <type>
        <types>EnumRef.вмс_ТипыЯчеек</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиОператора/вмс_НастройкиОператора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиОператора</name>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиФорм</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаОтветственногоХранения</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКоличествоРаспоряжений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРучнойВвод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разработчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвуковаяСхема</name>
    <type>
      <types>CatalogRef.вмс_Звуки</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрисвоениеШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МасштабФормы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
    <attributes>
      <name>МастерОперация</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ТипПринтера</name>
      <type>
        <types>EnumRef.ТипыПринтеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКомпьютера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКПринтеру</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>CatalogRef.вмс_Принтеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ячейки</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.вмс_Помещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_ПравилаЗаполненияЗадачиКладовщику/ManagerModule.bsl
// Процедура - Переопределяемый заполнить шапку задания
//
// Параметры:
//  ЗаданиеКладовищку	 -ДокументОбъект.ЗаданиеКладовщику 	 - Изменяемое задание кладовщику 
//  РеквизитыШапки		 -Структура 	 -Данные из СКД для заполнения шапки 
//  ПравилоЗаполнения	 -СправочникСсылка.вмс_ПравилаЗаполненияЗадачиКладовщику 	 - Элемент правил 
//
Процедура Переопределяемый_ЗаполнитьШапкуЗадания(ЗаданиеКладовищку, РеквизитыШапки, ПравилоЗаполнения) Экспорт
	//Кастомное заполнение шапки. 
	
КонецПроцедуры

Процедура Переопределяемый_ЗаполнитьТоварыЗадания(Правило, ТаблицаШапок, ТаблицаПланПоРаспоряжению, ТаблицаЗаданийКладовщикам) Экспорт
	//Кастомное заполнение таблицы товаров. 
	
КонецПроцедуры

Функция ПолучитьЭлементСправочникаОперацииПоИмени(СлужебноеИмя) Экспорт
	
	Возврат Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.НайтиПоРеквизиту("Имя",СлужебноеИмя);

КонецФункции

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Функция НайтиПравилоЗаполненияЗадания(ВидОперации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ПравилаЗаполненияЗадачиКладовщику.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_ПравилаЗаполненияЗадачиКладовщику КАК вмс_ПравилаЗаполненияЗадачиКладовщику
	|ГДЕ
	|	НЕ вмс_ПравилаЗаполненияЗадачиКладовщику.ПометкаУдаления
	|	И вмс_ПравилаЗаполненияЗадачиКладовщику.ОперацияНазначение = &ОперацияНазначение";
	Запрос.УстановитьПараметр("ОперацияНазначение", ВидОперации);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

///////////////////////////ТОВАРЫ + ///////////////////////////////////////     
//
//
//              

Функция ПолучитьСписокТоваровПоРаспоряжениям(ВходящиеПараметры, ВыводВТабличныйДокумент = Ложь) Экспорт   
	//ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД товаров в учетке
	Если ВыводВТабличныйДокумент Тогда
		РезультатТабДок = Новый ТабличныйДокумент;     
		ТипКомпоновщикаМакета = Тип("ГенераторМакетаКомпоновкиДанных");
	Иначе   
		ТипКомпоновщикаМакета = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	КонецЕсли; 
	//
	
	ВидОперации = Неопределено;
	ИмяДляПоиска = Неопределено;
	Если ТипЗнч(ВходящиеПараметры) = Тип("Структура") Тогда
		Распоряжения = ВходящиеПараметры.ПараметрДокументы;
		ВходящиеПараметры.Свойство("ВидОперации", ВидОперации);
		Если ВидОперации <> Неопределено Тогда
			ИмяДляПоиска = ВидОперации.ИмяДляПоиска;
		КонецЕсли;
	Иначе
		Распоряжения = ВходящиеПараметры;
	КонецЕсли;
		
	МассивРаспоряжений = вмс_РаботаСКоллекциями.ЗначениеВМассив(Распоряжения);
	ТаблицаРаспоряжений = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("Распоряжение, Тип");
	Для Каждого Распоряжение Из МассивРаспоряжений Цикл
		СтрокаРаспоряжения = ТаблицаРаспоряжений.Добавить();
		СтрокаРаспоряжения.Распоряжение = Распоряжение;
		СтрокаРаспоряжения.Тип = вмс_ОбщегоНазначенияВызовСервера.ПолучитьИмяТипаОбъекта(Распоряжение);
	КонецЦикла;
	
	ТаблицаТиповРаспоряжений = ТаблицаРаспоряжений.Скопировать();
	ТаблицаТиповРаспоряжений.Свернуть("Тип");
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Ссылка");
	
	Для Каждого СтрокаТипаРаспоряжений Из ТаблицаТиповРаспоряжений Цикл
		ТипРаспоряжения = СтрокаТипаРаспоряжений.Тип;
		СсылкаНаОписаниеТипаРаспоряжения = НайтиТипРаспоряженияДляДокумента(ТипРаспоряжения, ВидОперации); //ТУ_Кошелев_07.06.24 - изменения в связи с новой системой формирования запросов СКД распоряжений операций
		//ТУ_КС+
		Если СсылкаНаОписаниеТипаРаспоряжения = Неопределено Тогда
			Если ВидОперации.Распоряжения.Количество()=1 Тогда
				СсылкаНаОписаниеТипаРаспоряжения = ВидОперации.Распоряжения[0].СсылкаНаРаспоряжение;
			КонецЕсли;
		КонецЕсли;
		//ТУ_КС-
		
		Если СсылкаНаОписаниеТипаРаспоряжения = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ОписаниеТипаРаспоряжения = СсылкаНаОписаниеТипаРаспоряжения.ПолучитьОбъект();
		ОписаниеТипаРаспоряжения.Прочитать();
		СхемаКомпоновкиДанных = ОписаниеТипаРаспоряжения.ХранилищеСКДТовары.Получить();
		Если СхемаКомпоновкиДанных = Неопределено Тогда
			Продолжить;
		КонецЕсли;   
		
		СтрокиРаспоряженийПоТипу = ТаблицаРаспоряжений.НайтиСтроки(Новый Структура("Тип", ТипРаспоряжения));
		МассивРаспоряженийПоТипу = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(СтрокиРаспоряженийПоТипу, "Распоряжение");
		СписокЗначенийРаспоряженийПоТипу = Новый СписокЗначений;
		СписокЗначенийРаспоряженийПоТипу.ЗагрузитьЗначения(МассивРаспоряженийПоТипу);

		КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки);
		НастройкиКомпоновки = КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки();
		
		ВсеДоступныеПоля = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(НастройкиКомпоновки.Выбор.ДоступныеПоляВыбора.Элементы, "Имя");
		РаботаССКД.ВключитьПоляВыбораНастроекСКД(НастройкиКомпоновки, ВсеДоступныеПоля);
		РаботаССКД.УстановитьНастройкиДляПолученияКоллекцииЗначений(НастройкиКомпоновки);
		РаботаССКД.ДобавитьОтбор(НастройкиКомпоновки.Отбор.Элементы, "Ссылка", СписокЗначенийРаспоряженийПоТипу, ВидСравненияКомпоновкиДанных.ВСписке); 
		                                                           
		//установка операции параметром 
		ПараметрСКДОперация = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("Операция");
		Если ПараметрСКДОперация <> Неопределено Тогда
			ПараметрСКДОперация.Значение = ВидОперации;
			ПараметрСКДОперация.Использование = Истина;	
		КонецЕсли;
		//установка операции параметром	
		
		//установка операции параметром (по имени операции)
		ПараметрСКДОперацияИмя = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("ОперацияИмяДляПоиска");
		Если ПараметрСКДОперацияИмя <> Неопределено Тогда
			ПараметрСКДОперацияИмя.Значение = ИмяДляПоиска;
			ПараметрСКДОперацияИмя.Использование = Истина;	
		КонецЕсли;
		//установка операции параметром
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , ТипКомпоновщикаМакета); 
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		
		//ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД товаров в учетке
		//При просмотре результатов, обработка данных заканчивается здесь, если будут изменения в логике после этого момента, может привести к расхождениям результатов на ТСД и в учетке при просмотре.
		Если ВыводВТабличныйДокумент Тогда					
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(РезультатТабДок);
			ПроцессорВывода.Вывести(ПроцессорКомпоновки);   
		Иначе              
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
			ТаблицаТоваровПоТипуРаспоряжений = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
			
			вмс_РаботаСКоллекциями.ДополнитьКолонкиТаблицыЗначений(ТаблицаТоваров, , ТаблицаТоваровПоТипуРаспоряжений);
			вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(ТаблицаТоваров, ТаблицаТоваровПоТипуРаспоряжений);
		КонецЕсли;
		//
	КонецЦикла;
	
	//ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД товаров в учетке
	Если ВыводВТабличныйДокумент Тогда  
		Возврат РезультатТабДок;
	КонецЕсли;   
	//
	
	//ТУ_КС+
	ДополнитьТаблицуТоваровТоварнымиПолями(ТаблицаТоваров);
	//ТУ_КС-
	
	НастройкиКолонок = Новый ТаблицаЗначений;
	НастройкиКолонок.Колонки.Добавить("Имя");
	НастройкиКолонок.Колонки.Добавить("Заголовок");
	НастройкиКолонок.Колонки.Добавить("Ширина");
	
	ДанныеСпискаТоваров = Новый Структура;
	ДанныеСпискаТоваров.Вставить("НастройкиКолонок", НастройкиКолонок);
	ДанныеСпискаТоваров.Вставить("УсловноеОформление", Неопределено);
	ДанныеСпискаТоваров.Вставить("Таблица", ТаблицаТоваров);
	
	Возврат ДанныеСпискаТоваров;

КонецФункции

Функция ДополнитьТаблицуТоваровТоварнымиПолями(ТаблицаТоваров)
	
	ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля();
	ТипыДанныхКонфигурации = вмс_АдаптацияКонфигураций.ПолучитьТипыДанныхКонфигурации();
	
	Для Каждого ТоварноеПоле Из ТоварныеПоляМассив Цикл
		
		Если ТаблицаТоваров.Колонки.Найти(ТоварноеПоле) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеТипыПоля = ТипыДанныхКонфигурации.НайтиСтроки(Новый Структура("Наименование", ТоварноеПоле));
		МассивТиповПоля = Новый Массив;
		Для Каждого НайденныйТипПоля Из НайденныеТипыПоля Цикл
			ИмяТипаОбъектаИБ = НайденныйТипПоля.ТипДанных;
			Если Метаданные.НайтиПоПолномуИмени(ИмяТипаОбъектаИБ) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяТипаСсылкиОбъектаИБ = вмс_ОбщегоНазначенияВызовСервера.ПолучитьИмяТипаСсылкиОбъектаИБ(ИмяТипаОбъектаИБ);
			ТипПоля = Тип(ИмяТипаСсылкиОбъектаИБ);
			МассивТиповПоля.Добавить(ТипПоля);
		КонецЦикла;
		
		ОписаниеТиповПоля = Новый ОписаниеТипов(МассивТиповПоля);
		
		ТаблицаТоваров.Колонки.Добавить(ТоварноеПоле, ОписаниеТиповПоля);
		
	КонецЦикла;
	
КонецФункции

//
//
//
///////////////////////////ТОВАРЫ - ///////////////////////////////////////   

///////////////////////////ДОКУМЕНТЫ + ///////////////////////////////////////     
//
//
//

//ТУ_Кошелев_07.06.24 - изменения в связи с новой системой формирования запросов СКД распоряжений операций
Функция НайтиТипРаспоряженияДляДокумента(Документ, ВидОперации) Экспорт	
	Если ТипЗнч(Документ) = Тип("Строка") Тогда
		ИмяДокумента = Документ;
	Иначе
		ИмяДокумента = вмс_ОбщегоНазначенияВызовСервера.ПолучитьИмяТипаОбъекта(Документ);
	КонецЕсли;
	
	Если ИмяДокумента <> Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Имя", ИмяДокумента);
		Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	вмс_ОперацииРаспоряжения.СсылкаНаРаспоряжение КАК Ссылка
		|ИЗ
		|	Справочник.вмс_Операции.Распоряжения КАК вмс_ОперацииРаспоряжения
		|ГДЕ
		|	вмс_ОперацииРаспоряжения.Ссылка = &ВидОперации
		|	И вмс_ОперацииРаспоряжения.СсылкаНаРаспоряжение.РаспоряжениеКонфигуратор = &Имя";

		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
		ТипыРаспоряжений = ТаблицаЗапроса.ВыгрузитьКолонку("Ссылка");
	Иначе
		ТипыРаспоряжений = Новый Массив;
	КонецЕсли;
	
	Если ТипыРаспоряжений.Количество() = 1 Тогда
		//исключить дублирование
		Возврат ТипыРаспоряжений[0];
	КонецЕсли;	
КонецФункции

Функция УстановитьРабочиеСтатусыВНастройкахСКДСпискаДокументов(Операция, СхемаКомпоновкиДанных) Экспорт
	НастройкиСКД = СхемаКомпоновкиДанных.ВариантыНастроек[0].Настройки;
	ПредставлениеОтбора = "Отбор по рабочим статусам";
	ОтборПоРабочимСтатусам = вмс_РаботаСКоллекциями.НайтиЭлементКоллекции(НастройкиСКД.Отбор.Элементы, Новый Структура("Представление", ПредставлениеОтбора));
	Если ОтборПоРабочимСтатусам = Неопределено Тогда
		ОтборПоРабочимСтатусам = НастройкиСКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоРабочимСтатусам.Представление = ПредставлениеОтбора;
	КонецЕсли; 
	
	СписокРабочихСтатусов = Новый СписокЗначений;      
	
	ЭтапКОбработке = Справочники.вмс_ЭтапыОперации.НайтиПоРеквизиту("Имя", "КОбработке");
	
	СтрокиРабочихСтатусов = Операция.ЭтапыОперации.НайтиСтроки(Новый Структура("Этап", ЭтапКОбработке));
	МассивРабочихСтатусовКОбработке = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(СтрокиРабочихСтатусов, "Статус");
	
	
	ЭтапВРаботе = Справочники.вмс_ЭтапыОперации.НайтиПоРеквизиту("Имя", "ВРаботе");
	
	СтрокиРабочихСтатусов = Операция.ЭтапыОперации.НайтиСтроки(Новый Структура("Этап", ЭтапВРаботе));
	МассивРабочихСтатусовВРаботе = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(СтрокиРабочихСтатусов, "Статус");
	
	МассивРабочихСтатусов = вмс_РаботаСКоллекциями.СложениеМассивов(МассивРабочихСтатусовКОбработке,МассивРабочихСтатусовВРаботе);
	СписокРабочихСтатусов.ЗагрузитьЗначения(МассивРабочихСтатусов);
	
	ОтборПоРабочимСтатусам.Использование = Истина;
	ОтборПоРабочимСтатусам.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	ОтборПоРабочимСтатусам.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборПоРабочимСтатусам.ПравоеЗначение = СписокРабочихСтатусов;
КонецФункции     

Функция УстановитьОтборПоСкладам(Склады, НастройкиСКД) Экспорт
	ПредставлениеОтбора = "Отбор по складам";
	ОтборПоСкладам = вмс_РаботаСКоллекциями.НайтиЭлементКоллекции(НастройкиСКД.Отбор.Элементы, Новый Структура("Представление", ПредставлениеОтбора));
	Если ОтборПоСкладам = Неопределено Тогда
		ОтборПоСкладам = НастройкиСКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоСкладам.Представление = ПредставлениеОтбора;
	КонецЕсли; 
	
	СписокСкладов = Новый СписокЗначений;
	СписокСкладов.ЗагрузитьЗначения(Склады);
	
	ОтборПоСкладам.Использование = Истина;
	ОтборПоСкладам.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Склад");
	ОтборПоСкладам.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборПоСкладам.ПравоеЗначение = СписокСкладов;
КонецФункции

Функция ПолучитьДанныеПоРаспоряжению(Операция, Распоряжение, ВходящиеПараметры, ВыводВТабличныйДокумент = Ложь) Экспорт   
	//ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД документов в учетке
	Если ВыводВТабличныйДокумент Тогда    
		РезультатТабДок = Новый ТабличныйДокумент;     
		ТипКомпоновщикаМакета = Тип("ГенераторМакетаКомпоновкиДанных");
	Иначе                                                                                   
		Результат = Неопределено;
		ТипКомпоновщикаМакета = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	КонецЕсли;               
	//
	
	Попытка
		СхемаКомпоновкиДанных = Распоряжение.ХранилищеСКДДокументы.Получить();	 
		
		Если СхемаКомпоновкиДанных <> Неопределено Тогда
			УстановитьРабочиеСтатусыВНастройкахСКДСпискаДокументов(Операция, СхемаКомпоновкиДанных);  
			
			КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
			КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки);
			НастройкиКомпоновки = КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки();
			
			ПоляКомпоновкиОтборов = вмс_РаботаСКоллекциями.СтрокуВМассив("Ссылка, Номер, Дата");
			ЭлементыОтборов = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(НастройкиКомпоновки.УсловноеОформление.Элементы, "Отбор.Элементы");
			ЭлементыОтборов = вмс_РаботаСКоллекциями.ВыгрузитьЭлементыКоллекцииВМассив(ЭлементыОтборов, 1);
			ЭлементыОтборов = вмс_РаботаСКоллекциями.ПреобразоватьИерархическуюКоллекциюВПлоскую(ЭлементыОтборов, "Элементы");
			ЗначенияОтборов = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(ЭлементыОтборов, "ЛевоеЗначение, ПравоеЗначение");
			Для Каждого ЗначениеОтбора Из ЗначенияОтборов Цикл
				Если ТипЗнч(ЗначениеОтбора) = Тип("ПолеКомпоновкиДанных") Тогда
					ИмяПоля = Строка(ЗначениеОтбора);
					Если ПоляКомпоновкиОтборов.Найти(ИмяПоля) = Неопределено Тогда
						ПоляКомпоновкиОтборов.Добавить(ИмяПоля);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			РаботаССКД.ВключитьПоляВыбораНастроекСКД(НастройкиКомпоновки, ПоляКомпоновкиОтборов);
			РаботаССКД.УстановитьНастройкиДляПолученияКоллекцииЗначений(НастройкиКомпоновки);  
			
			//Отбор по складам  
			Попытка
				Если ВходящиеПараметры.Свойство("Оператор") Тогда 	
					Склады = Справочники.вмс_НастройкиОператора.ПолучитьДоступныеСкладыОператора(ВходящиеПараметры.Оператор);
					Если ЗначениеЗаполнено(Склады) Тогда     
						УстановитьОтборПоСкладам(Склады, НастройкиКомпоновки);
					КонецЕсли; 	                                
				КонецЕсли;				
			Исключение
				ЗаписьЖурналаРегистрации("ТСД", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
			КонецПопытки;
			//Отбор по складам 
			
			//установка операции параметром 
			ПараметрСКДОперация = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("Операция");
			Если ПараметрСКДОперация <> Неопределено Тогда
				ПараметрСКДОперация.Значение = Операция;
				ПараметрСКДОперация.Использование = Истина;	
			КонецЕсли;
			//установка операции параметром 
			
			//установка операции параметром (по имени операции)
			ПараметрСКДОперацияИмя = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("ОперацияИмяДляПоиска");
			Если ПараметрСКДОперацияИмя <> Неопределено Тогда
				ПараметрСКДОперацияИмя.Значение = Операция.ИмяДляПоиска;
				ПараметрСКДОперацияИмя.Использование = Истина;	
			КонецЕсли;
			//установка операции параметром    
			
			//установить одноименные параметры скд
			Для Каждого ВходящийПараметр Из ВходящиеПараметры Цикл
				ПараметрСКД = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти(ВходящийПараметр.Ключ);
				Если ПараметрСКД <> Неопределено Тогда
					ПараметрСКД.Значение = ВходящийПараметр.Значение;
					ПараметрСКД.Использование = Истина;	
				КонецЕсли;
			КонецЦикла;

			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки,,, ТипКомпоновщикаМакета); 
			
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
			
			//ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД документов в учетке
			//При просмотре результатов, обработка данных заканчивается здесь, если будут изменения в логике после этого момента, может привести к расхождениям результатов на ТСД и в учетке при просмотре.
			Если ВыводВТабличныйДокумент Тогда					
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
				ПроцессорВывода.УстановитьДокумент(РезультатТабДок);
				ПроцессорВывода.Вывести(ПроцессорКомпоновки);   
			Иначе                                                                              
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
				Таблица = ПроцессорВывода.Вывести(ПроцессорКомпоновки); 
				
				Результат = Новый Структура;
				Результат.Вставить("Таблица", Таблица);
				Результат.Вставить("НастройкиКомпоновки", НастройкиКомпоновки);
			КонецЕсли;  
			//
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	//ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД документов в учетке
	Если ВыводВТабличныйДокумент Тогда     
		Возврат РезультатТабДок;
	Иначе
		Возврат Результат;     
	КонецЕсли;
	//
КонецФункции
	
//
//
//
///////////////////////////ДОКУМЕНТЫ - ///////////////////////////////////////

//////////////////////////////////////////////////////////////////
//
//					Настройка полей+
//

Функция ЗаписатьНастройкуПолейПоУмолчаниюСтарая(Правило)
	
	СсылкаНастройкиПолей = Справочники.вмс_НастройкиПолейЗадания.ПолучитьНастройкуПолейПоВладельцу(Правило.Ссылка);
	СтруктураНастройкиПолей = СтруктураНастройкиПолейПоУмолчанию(Правило);
	Справочники.вмс_НастройкиПолейЗадания.ОбновитьНастройкуПолей(СсылкаНастройкиПолей, СтруктураНастройкиПолей);
	
КонецФункции

Функция СтруктураНастройкиПолей(Правило) Экспорт

	Если Правило.АвтоНастройкаПолей Тогда
		Возврат СтруктураНастройкиПолейПоУмолчанию(Правило);
	Иначе
		Если ЗначениеЗаполнено(Правило.Ссылка) Тогда
			СсылкаНастройкиПолей = Справочники.вмс_НастройкиПолейЗадания.НайтиНастройкуПолейПоВладельцу(Правило.Ссылка);
		КонецЕсли;
		Если ЗначениеЗаполнено(СсылкаНастройкиПолей) Тогда
			Возврат Справочники.вмс_НастройкиПолейЗадания.СтруктураНастройкиПолей(СсылкаНастройкиПолей);
		Иначе
			Возврат Справочники.вмс_НастройкиПолейЗадания.СтруктураНастройкиПолейПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция СтруктураНастройкиПолейПоУмолчанию(Правило) Экспорт
	
	СтруктураНастройкиПолей = Справочники.вмс_НастройкиПолейЗадания.СтруктураНастройкиПолейПоУмолчанию();
	
	СвойстваПолей = ПолучитьСвойстваПолейДокументаПоУмолчанию(Правило);
	вмс_РаботаСКоллекциями.УстановитьЭлементыКоллекции(СтруктураНастройкиПолей.НастройкаПолей, СвойстваПолей);
	
	Возврат СтруктураНастройкиПолей;

КонецФункции

Функция ПолучитьСвойстваПолейДокументаПоУмолчанию(Правило) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	// инициализируется полями из задания кладовищку
	// по умолчанию все свойства = Ложь, явное определенение не требуется
	ТаблицаНастройки = вмс_СерверУправляемыеОперации.ТаблицаЗначенийСвойствПолейОперацииПоУмолчанию();
	
	Отбирать = Ложь;
	Размещать = Ложь;

	ВключитьИнфоПоле(ТаблицаНастройки, "Операция");
	ВключитьИнфоПоле(ТаблицаНастройки, "Распоряжение");
	ВключитьИнфоПоле(ТаблицаНастройки, "Ссылка");
	ВключитьИнфоПоле(ТаблицаНастройки, "Комментарий");
	
	// ПОДСКАЗКА СЛЕДУЮЩЕГО ДЕЙСТВИЯ
	ВключитьПолеПодсказки(ТаблицаНастройки);
	
	// ЯЧЕЙКА ОТПРАВИТЕЛЬ     
	Если Правило.ПодбиратьЯчейкиОтправители Тогда
		Если Правило.ИспользоватьЗонуОтправитель ИЛИ Правило.ОтгружатьСоСлужебнойЗоныОтправителя ИЛИ Правило.УстанавливатьЯчейкуОтправитель Тогда
			Настройка = ВключитьИнфоПоле(ТаблицаНастройки, "ЗонаОтправитель");
			Настройка.План = Истина;
			
			Настройка = ВключитьПоле(ТаблицаНастройки, "Ячейка");
			Настройка.Ввод = Ложь;
			Настройка.Вывод = Ложь;
			Настройка.ПутьКДаннымЗаполнения = "ЗонаОтправитель";
		Иначе
			Настройка = ВключитьПоле(ТаблицаНастройки, "Ячейка"); 
			Если Правило.НестрогоеПланированиеЯчейкиОтбора Тогда
				Настройка.План = Ложь;
			КонецЕсли;
			Отбирать = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ЛицензияКонтейнерыДоступна = вмс_УправлениеОстаткамиНовыйВызовСервера.ЛицензияКонтейнерыДоступна();
	Если ЛицензияКонтейнерыДоступна Тогда
		Если Правило.Контейнеры_РазбиратьКонтейнеры Тогда
			Настройка = ВключитьПоле(ТаблицаНастройки, "КонтейнерОтправитель");
			Настройка.План = НЕ Правило.Контейнеры_РазбиратьКонтейнеры_НестрогоеПланирование;
		КонецЕсли;

		Если Правило.Контейнеры_ПеремещатьЦелыми Тогда
			Настройка = ВключитьПоле(ТаблицаНастройки, "Контейнер");
			Настройка.План = НЕ Правило.Контейнеры_ПеремещатьЦелыми_НестрогоеПланирование;
		КонецЕсли;

		Если Правило.Контейнеры_СобиратьКонтейнеры Тогда
			Настройка = ВключитьПоле(ТаблицаНастройки, "КонтейнерПриемник");
			Настройка.План = НЕ Правило.Контейнеры_СобиратьКонтейнеры_НестрогоеПланирование;
		КонецЕсли;
	КонецЕсли;
	
	
	// ТОВАРНЫЕ ПОЛЯ
	ТоварныеПоля = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля();

	ИспользуетсяКачество = ТоварныеПоля.Найти("Качество") <> Неопределено; РК.ВычестьМассив(ТоварныеПоля, "Качество");
	Для Каждого ТоварноеПоле Из ТоварныеПоля Цикл
		Если ТоварноеПоле="Товар" Тогда
			НастройкаТовара = НастройкаПоля(ТаблицаНастройки, "Товар");
			НастройкаАртикула = ВключитьИнфоПоле(ТаблицаНастройки, "Артикул");
			НастройкаАртикула.Страница = НастройкаТовара.Страница;
			НастройкаАртикула.ПоложениеЗаголовка = "Авто";

			НастройкаМаркировка = ВключитьПоле(ТаблицаНастройки, "Маркировка");
			НастройкаМаркировка.План = Ложь;
			НастройкаМаркировка.Вывод = Ложь;
			НастройкаМаркировка.ОбязательноеЗаполнение = Ложь;
		КонецЕсли;
		Настройка = ВключитьПоле(ТаблицаНастройки, ТоварноеПоле);
	КонецЦикла;
	
	// КАЧЕСТВО
	Если ИспользуетсяКачество Тогда 
		Настройка = ВключитьПоле(ТаблицаНастройки, "Качество"); 
		Настройка.ПутьКДаннымЗаполнения = "Задание.КачествоПоУмолчанию";
		Настройка.ПутьКДаннымСохранения = "ОперацияПоЯчейкам.Товары.Качество";
		Настройка.ПутьРодителяДанныхЗаполнения = "Задание";
		Настройка.ПутьРодителяДанныхСохранения = "ОперацияПоЯчейкам.Товары";
		Настройка.План = Ложь;
		Настройка.ОбязательныйВвод = Ложь;
	КонецЕсли;
	
	
	// УПАКОВКИ
	Если Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("Упаковки_ВестиУчетОстатковПоУпаковкам") = Истина Тогда;
		Настройка = ВключитьПоле(ТаблицаНастройки, "Упаковка"); 
		Настройка.План = Правило.Упаковка_ВводПоПлану; 		
	КонецЕсли;
	
	Если Отбирать Тогда
		Настройка = ВключитьПоле(ТаблицаНастройки, "КоличествоОтобрано");
	КонецЕсли;
	
	// ЯЧЕЙКА ПОЛУЧАТЕЛЬ
	Если Правило.ПриниматьНаСлужебнуюЗонуПолучатель ИЛИ Правило.УстанавливатьЯчейкуПолучатель ИЛИ Правило.РучнойВводЗоныПолучателя Тогда
		// если заполнена зона получаетель - то она дозаполняет ввод автоматически
		Настройка = ВключитьИнфоПоле(ТаблицаНастройки, "ЗонаПолучатель");
		Настройка.План = Истина;
		
		Если Правило.ПодтверждатьЗонуПолучатель Тогда
			Настройка.Ввод = Истина;
			// если заполнена зона получатель - то она дозаполняет ввод автоматически
			Настройка = ВключитьПоле(ТаблицаНастройки, "ЯчейкаПриемник");
			Настройка.Ввод = Ложь;
			Настройка.Вывод = Ложь;
			Настройка.ПутьКДаннымЗаполнения = "ДанныеВвода.ЗонаПолучатель";
		Иначе
			// если заполнена зона получатель - то она дозаполняет ввод автоматически
			Настройка = ВключитьПоле(ТаблицаНастройки, "ЯчейкаПриемник");
			Настройка.Ввод = Ложь;
			Настройка.Вывод = Ложь;
			Настройка.ПутьКДаннымЗаполнения = "ЗонаПолучатель";
		КонецЕсли;
		
	ИначеЕсли Правило.ПодбиратьЯчейкиПолучатели Тогда
		
		// При заполнении в строке и отсутствии общей ячейки вводится пользователем.
		Настройка = ВключитьПоле(ТаблицаНастройки, "ЯчейкаПриемник");
		Если Правило.СтрогоеПланированиеЯчейки = Ложь Тогда
			Настройка.План = Ложь;
		КонецЕсли;
		Размещать = Истина;
		
	КонецЕсли;

	Если Размещать Тогда
		Настройка = ВключитьПоле(ТаблицаНастройки, "КоличествоРазмещено");
	КонецЕсли;
	
	Если НЕ Отбирать И НЕ Размещать Тогда
		Настройка = ВключитьПоле(ТаблицаНастройки, "Количество");
	КонецЕсли;
	
	УдалитьНеиспользуемыеПоля(ТаблицаНастройки);

	ТаблицаНастройки.Сортировать("ПорядокВвода");
	
	Возврат ТаблицаНастройки;
	
КонецФункции

Функция НастройкаПоля(ТаблицаНастройки, ИмяПоля)
	
	ПолеМассив = ТаблицаНастройки.НайтиСтроки(Новый Структура("Имя", ИмяПоля));
	
	Если ПолеМассив.Количество()=0 Тогда
		Поле = ТаблицаНастройки.Добавить();
		Поле.Имя = ИмяПоля;
		Поле.Использование = Ложь;
	Иначе
		Поле = ПолеМассив[0];
	КонецЕсли;
	
	Возврат Поле;
		
КонецФункции

Функция ВключитьПолеПодсказки(ТаблицаНастройки)
	
	Поле = ВключитьПоле(ТаблицаНастройки, "Подсказка");
	
	Поле.Страница = "ГлавнаяПанельСтраницаВводДанных";
	Поле.ПоложениеЗаголовка = "Нет";
	Поле.План = Ложь;
	Поле.Ввод = Ложь;
	Поле.Сборка = Ложь;
	Поле.ОбязательноеЗаполнение = Ложь;
	
	Возврат Поле;
	
КонецФункции

Функция ВключитьПоле(ТаблицаНастройки, ИмяПоля)
	
	Поле = НастройкаПоля(ТаблицаНастройки, ИмяПоля);
	Если НЕ Поле.Использование Тогда
		Поле.ПорядокВвода = ПолучитьПорядокДляНовогоПоля(ТаблицаНастройки);
		Поле.Использование = Истина;
	КонецЕсли;
	Поле.План = Истина; 
	Поле.Ввод = Истина;
	Поле.Сборка = Истина;
	Поле.Вывод = Истина;
	Поле.ОбязательныйВвод = Истина;
	Поле.ОбязательноеЗаполнение = Истина;
	
	Возврат Поле;
	
КонецФункции

Функция ВключитьИнфоПоле(ТаблицаНастройки, ИмяПоля)
	
	Поле = ВключитьПоле(ТаблицаНастройки, ИмяПоля);
	Поле.План = Ложь; 
	Поле.Ввод = Ложь;
	Поле.Сборка = Ложь;
	Поле.Вывод = Истина;
	Поле.Страница = Обработки.вмс_СерверУправляемыйМодульОперацияПоЯчейкамУниверсальная.ПрефиксСтраницОперации() + "Инфо";
	Поле.ПоложениеЗаголовка = "Нет";
	
	Возврат Поле;
	
КонецФункции 

Функция ПолучитьПорядокДляНовогоПоля(ТаблицаНастройки)
	
	Порядок = 0;
	ВключенныеПоля = ТаблицаНастройки.НайтиСтроки(Новый Структура("Использование", Истина));
	Для Каждого Поле Из ВключенныеПоля Цикл
		Если Порядок < Поле.ПорядокВвода Тогда
			Порядок = Поле.ПорядокВвода;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Порядок+1;
	
КонецФункции

Функция УдалитьНеиспользуемыеПоля(ТаблицаНастройки)
	
	Для Каждого Поле Из ТаблицаНастройки.НайтиСтроки(Новый Структура("Использование", Ложь)) Цикл
		
		ТаблицаНастройки.Удалить(Поле);
		
	КонецЦикла;
	
КонецФункции

//
//					Настройка полей-
//
//////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////
//
//					Настройка полей1 (Новая)+
//

Функция ЗаписатьНастройкуПолейПоУмолчанию(Правило) Экспорт
	
	Если вмс_НастройкиПолейЗадания1.ИспользоватьНовуюСистему() Тогда
		ЗаписатьНастройкуПолейПоУмолчанию1(Правило);
	Иначе
		ЗаписатьНастройкуПолейПоУмолчаниюСтарая(Правило);
	КонецЕсли;
	
КонецФункции

Функция ЗаписатьНастройкуПолейПоУмолчанию1(Правило)
КонецФункции

Функция ЗаполнитьНастройкуПолейПоУмолчанию1(Правило, ДанныеОбъектаНастройкиПолей) Экспорт
	
	Настройка = ПолучитьНастройкуПолейПоУмолчанию1(Правило);
	
	вмс_НастройкиПолейЗадания1.СохранитьНастройку(Настройка, ДанныеОбъектаНастройкиПолей);
	
КонецФункции

Функция ПолучитьНастройкуПолейПоУмолчанию1(Правило)
	
	Настройка = Справочники.вмс_НастройкиПолейЗадания.ПолучитьНастройкуПолейПоУмолчанию1();
	
	НачатьКонструированиеЭлементов(Настройка);
		НачатьКонструированиеСтраницыВводаДанных(Настройка, "Инфо");
			ДобавитьПолеДанных(Настройка, "Операция");
			ДобавитьПолеДанных(Настройка, "Распоряжение");
			ДобавитьПолеДанных(Настройка, "Ссылка");
			ДобавитьПолеДанных(Настройка, "Комментарий");
		ЗакончитьКонструированиеСтраницыВводаДанных(Настройка);
		
	ЗакончитьКонструированиеЭлементов(Настройка);
	
	Возврат Настройка;
	
КонецФункции

// Алиасы
Функция НачатьКонструированиеЭлементов(Настройка)
	
	Возврат вмс_НастройкиПолейЗадания1.НачатьКонструированиеЭлементов(Настройка);
	
КонецФункции

Функция ЗакончитьКонструированиеЭлементов(Настройка)
	
	Возврат вмс_НастройкиПолейЗадания1.ЗакончитьКонструированиеЭлементов(Настройка);
	
КонецФункции

Функция НачатьКонструированиеСтраницыВводаДанных(Настройка, СтраницаВвода)
	
	Возврат вмс_НастройкиПолейЗадания1.НачатьКонструированиеСтраницыВводаДанных(Настройка, СтраницаВвода);
	
КонецФункции

Функция ЗакончитьКонструированиеСтраницыВводаДанных(Настройка, СтраницаВвода=Неопределено)
	
	Возврат вмс_НастройкиПолейЗадания1.ЗакончитьКонструированиеСтраницыВводаДанных(Настройка, СтраницаВвода);
	
КонецФункции

Функция ДобавитьПолеДанных(Настройка, Имя)

	Возврат вмс_НастройкиПолейЗадания1.ДобавитьПолеДанных(Настройка, , Имя);
	
КонецФункции

//
//					Настройка полей1 (Новая)+
//
//////////////////////////////////////////////////////////////////

#КонецЕсли
